In [4]:
import pandas as pd
!cat example-ex1.csv

In [5]:
df = pd.read_csv('example-ex1.csv')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_table('example-ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
!cat example-ex2.csv

In [10]:
pd.read_csv('example-ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [11]:
pd.read_csv('example-ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
names = ['a','b','c','d','message']

In [18]:
pd.read_csv('example-ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!cat example-ex3.csv

In [20]:
parsed = pd.read_csv('example-ex3.csv',index_col=['key1','key2'])

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [23]:
list(open('example-ex4.txt'))

['     A          B          C\n',
 'aaa  -0.264438  -1.026059  -0.619500\n',
 'bbb  0.927272   0.302904   -0.032399\n',
 'ccc  -0.264273  -0.386314  -0.217601\n',
 'ddd  -0.871858  -0.348382  1.100491']

In [24]:
result = pd.read_table('example-ex4.txt',sep = '\s+')

In [25]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [26]:
!cat example-ex3.csv

In [27]:
pd.read_csv('example-ex3.csv',skiprows=[0,2,3])

   one  a   1   2
0  one  d   7   8
1  two  a   9  10
2  two  b  11  12
3  two  c  13  14
4  two  d  15  16

In [29]:
!cat example-ex4.csv

In [30]:
result = pd.read_csv('example-ex4.csv')

In [31]:
result

  key1 key2  value1  value2
0  one    a       1     2.0
1  one    b       3     4.0
2  one    c       5     NaN
3  one    d       7     8.0
4  two    a       9    10.0
5  two    b      11    12.0
6  two    c      13    14.0
7  two    d      15    16.0

In [32]:
pd.isnull(result)

    key1   key2  value1  value2
0  False  False   False   False
1  False  False   False   False
2  False  False   False    True
3  False  False   False   False
4  False  False   False   False
5  False  False   False   False
6  False  False   False   False
7  False  False   False   False

In [33]:
result = pd.read_csv('example-ex4.csv',na_values=['NULL'])

In [34]:
result

  key1 key2  value1  value2
0  one    a       1     2.0
1  one    b       3     4.0
2  one    c       5     NaN
3  one    d       7     8.0
4  two    a       9    10.0
5  two    b      11    12.0
6  two    c      13    14.0
7  two    d      15    16.0

In [38]:
sentinels = {'key1':['one'],'values':[7,9]}

In [39]:
pd.read_csv('example-ex4.csv',na_values=sentinels)

  key1 key2  value1  value2
0  NaN    a       1     2.0
1  NaN    b       3     4.0
2  NaN    c       5     NaN
3  NaN    d       7     8.0
4  two    a       9    10.0
5  two    b      11    12.0
6  two    c      13    14.0
7  two    d      15    16.0

In [40]:
pd.options.display.max_rows = 10

In [41]:
result = pd.read_csv('example-ex5.csv')

In [43]:
result

                     序号        ...                       出货时间
0                     1        ...                        NaN
1                     2        ...                        NaN
2                     3        ...                        NaN
3                     4        ...                        NaN
4                     5        ...                        NaN
...                 ...        ...                        ...
2568               2569        ...                        NaN
2569               2570        ...          2018年2月24日 下午8:36
2570               2571        ...          2018年2月24日 下午8:36
2571                NaN        ...                        NaN
2572  2019年5月15日 上午9:29        ...                        NaN

[2573 rows x 15 columns]

In [44]:
pd.read_csv('example-ex5.csv',nrows=5)

   序号           栈板ID  PPBOX ID ...  Label No.                入库时间 出货时间
0   1  TP-190514-001  D9900726 ...        NaN                 NaN  NaN
1   2  TP-190514-001  D9900727 ...        NaN                 NaN  NaN
2   3  TP-190422-001  D9900590 ...        NaN  2019年5月14日 上午10:18  NaN
3   4  TP-190422-001  D9900593 ...        NaN  2019年5月14日 上午10:18  NaN
4   5  TP-190422-001  D9900594 ...        NaN  2019年5月14日 上午10:18  NaN

[5 rows x 15 columns]

In [45]:
chunker = pd.read_csv('example-ex5.csv',chunksize=1000)

In [46]:
chunker

In [47]:
chunker = pd.read_csv('example-ex5.csv',chunksize=1000)

In [53]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['Lot ID'].value_counts(),fill_value=0)

In [55]:
tot[:10]

98814    38.0
98A18    30.0
98802    28.0
98730    22.0
98801    22.0
98830    21.0
98731    20.0
98804    18.0
98A17    15.0
98815    15.0
dtype: float64

In [59]:
data = pd.read_csv('example-ex4.csv')

In [60]:
data

  key1 key2  value1  value2
0  one    a       1     2.0
1  one    b       3     4.0
2  one    c       5     NaN
3  one    d       7     8.0
4  two    a       9    10.0
5  two    b      11    12.0
6  two    c      13    14.0
7  two    d      15    16.0

In [61]:
data.to_csv('example-out.csv')

In [62]:
!cat example-out.csv

,key1,key2,value1,value2
0,one,a,1,2.0
1,one,b,3,4.0
2,one,c,5,
3,one,d,7,8.0
4,two,a,9,10.0
5,two,b,11,12.0
6,two,c,13,14.0
7,two,d,15,16.0

In [63]:
import sys

In [66]:
data.to_csv(sys.stdout,sep='|')

|key1|key2|value1|value2
0|one|a|1|2.0
1|one|b|3|4.0
2|one|c|5|
3|one|d|7|8.0
4|two|a|9|10.0
5|two|b|11|12.0
6|two|c|13|14.0
7|two|d|15|16.0

In [67]:
data.to_csv(sys.stdout,na_rep='NULL')

,key1,key2,value1,value2
0,one,a,1,2.0
1,one,b,3,4.0
2,one,c,5,NULL
3,one,d,7,8.0
4,two,a,9,10.0
5,two,b,11,12.0
6,two,c,13,14.0
7,two,d,15,16.0

In [68]:
data.to_csv(sys.stdout,index=False,header=False)

one,a,1,2.0
one,b,3,4.0
one,c,5,
one,d,7,8.0
two,a,9,10.0
two,b,11,12.0
two,c,13,14.0
two,d,15,16.0

In [71]:
data.to_csv(sys.stdout,index=False,columns=['key1','key2','value1'])

key1,key2,value1
one,a,1
one,b,3
one,c,5
one,d,7
two,a,9
two,b,11
two,c,13
two,d,15

In [73]:
dates = pd.date_range('1/1/2000',periods=7)

In [74]:
ts = pd.Series(np.arange(7),index=dates)

In [77]:
ts.to_csv('example-ex6,csv')

In [78]:
!cat example-ex6,csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [80]:
!cat example-ex3.csv

In [82]:
import csv

In [83]:
f = open('example-ex3.csv')

In [84]:
reader = csv.reader(f)

In [85]:
for line in reader:
    print(line)

['\ufeffkey1', 'key2', 'value1', 'value2']
['one', 'a', '1', '2']
['one', 'b', '3', '4']
['one', 'c', '5', '6']
['one', 'd', '7', '8']
['two', 'a', '9', '10']
['two', 'b', '11', '12']
['two', 'c', '13', '14']
['two', 'd', '15', '16']

In [86]:
with open('example-ex3.csv') as f:
    lines = list(csv.reader(f))

In [87]:
header,values = lines[0],lines[1:]

In [88]:
data_dict = {h:v for h,v in zip(header,zip(*values))}

In [89]:
data_dict

{'\ufeffkey1': ('one', 'one', 'one', 'one', 'two', 'two', 'two', 'two'),
 'key2': ('a', 'b', 'c', 'd', 'a', 'b', 'c', 'd'),
 'value1': ('1', '3', '5', '7', '9', '11', '13', '15'),
 'value2': ('2', '4', '6', '8', '10', '12', '14', '16')}

In [185]:
obj ="""
{"name":"web",
"places_lived":["A","B","C","D"],
"pet":None,
"silibings":[{"age":30,"name":"Scott","pets":['Zeus','Zuko']},
             {"age":38,"name":"Kitie","pets":['Sixes','Stache','Cisco']}]
}
"""

In [187]:
import json
res = json.loads(obj)

JSONDecodeError: Expecting value: line 4 column 7 (char 56)

In [188]:
res

NameError: name 'res' is not defined